cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'atuin'
brew 'fish'
brew 'wget'
brew 'tmux'

brew 'go'
brew 'node'
brew 'docker'

brew 'cocoapods'
brew 'swiftgen'
brew 'swiftlint'
brew 'sourcery'

brew 'cmake'
brew 'conan'
brew 'ninja'
brew 'mingw-w64'

brew 'pyenv'
brew 'python@3.14'
 
cask 'ghostty'
cask 'visual-studio-code'
cask 'zed'
cask 'notion'
cask 'steam'
cask 'vlc'
cask 'qbittorrent'
cask 'zoom'
cask 'telegram'
cask 'slack'
cask 'figma'
cask 'firefox'
cask 'sourcetree'